--[[
吸盘吸取物体从A移动到B
p1：抓取位置
p11：抓取位置上方点
p2：目标位置
P21：目标位置上方点
vel：运动速度
v_slow：过渡速度
blend：运动过渡参数
EY12：吸盘工具 上/下
EY9：吸盘打开/关闭
t1：程序间间时间
t2： IO间隔时间
--]]


function move(p1,p11,p2,p21)

vel=100
blend=0
t2=100

R.MP(p11,vel,blend)  --移动到抓取位置上方
R.WAIT()   --等待运动结束
--EY12=1  --吸盘工具下探
R.DELAY_MS(t2)
R.MP(p1,vel,blend)  --移动到抓取位置
R.WAIT()   --等待运动结束
EY9=1  --吸盘打开
R.DELAY_MS(t2)
R.MP(p11,vel,blend)  --移动到抓取位置上方
R.MP(p21,vel,blend) --移动到目标位置上方
R.MP(p2,vel,blend)  --移动到目标位置
R.WAIT()   --等待运动结束
EY9=0  --吸盘关闭
R.DELAY_MS(t2)
R.MP(p21,vel,blend)  --移动到目标位置上方
R.WAIT()   --等待运动结束
--EY12=0  --吸盘工具收回
--R.DELAY_MS(t2)

end


--[[
将物体从A拿取到B插上
p1：抓取位置
p11：抓取位置上方点
p2：目标位置
P21：目标位置上方点
vel：运动速度
v_slow：过渡速度
blend：运动过渡参数
EY11：夹爪工具 上/下
EY10：夹爪 抓取/松开
t1：程序间间时间
t2： IO间隔时间
--]]


function plug(p1,p11,p2,p21)

vel=100
blend=0
t2=100

R.MP(p11,vel,blend)  --移动到抓取位置上方
R.WAIT()   --等待运动结束
--EY11=1  --夹爪工具下探
R.DELAY_MS(t2)
R.MP(p1,vel,blend)  --移动到抓取位置
R.WAIT()   --等待运动结束
EY10=1  --夹爪抓取
R.DELAY_MS(t2)
R.MP(p11,vel,blend)  --移动到抓取位置上方
R.MP(p21,vel,blend)  --移动到目标位置上方
R.MP(p2,vel,blend)  --移动到目标位置
R.WAIT()   --等待运动结束
EY10=0  --夹爪松开
R.DELAY_MS(t2)
R.MP(p21,vel,blend)  --移动到目标位置上方
R.WAIT()   --等待运动结束
--EY11=0  --夹爪工具收回
--R.DELAY_MS(t2)

end


--[[
EY9=1  --吸盘工具向下
EY9=0  --吸盘工具收回
EY10=1  --吸盘io打开
EY10=0  --吸盘io关闭
EY11=1  --插件工具向下
EY11=0  --插件工具收回
EY12=1  --插件夹爪抓住
EY12=0  --插件夹爪松开
EY13=1  --涂胶工具向下
EY13=0  --涂胶工具收回
EY14=1  --激光笔打开
EY14=0  --激光笔关闭
--]]


--通用运行速度
vel=100
blend=0

--过渡点运行速度
v_slow=1

--IO间隔时间
t1=100

--程序之间间隔
t2=1000



P = {}

P[0] =  {X=600, Y=0, Z=0, A=0.000, B=0.000, C=0, POSE=1} --安全位置

--矩阵位置移动P[1]-P[50]
--第一个抓取点
P[10] =  {X=47.910, Y=-422.233, Z=-151.338, A=0.000, B=0.000, C=-3.073, POSE=1}--抓取点
P[11] =   {X=47.910, Y=-422.233, Z=-101.338, A=0.000, B=0.000, C=-3.073, POSE=1}--抓取点上方

-- 第一个目标点
P[12] =  {X=47.910, Y=-287.772, Z=-152.688, A=0.000, B=0.000, C=-3.073, POSE=1}  --放置点
P[13] = {X=47.910, Y=-287.772, Z=-102.688, A=0.000, B=0.000, C=-3.073, POSE=1}  --放置点上方

--第二个抓取点
P[14] =  {X=92.595, Y=-423.313, Z=-153.291, A=0.000, B=0.000, C=-3.073, POSE=1} --抓取点
P[15] =  {X=92.595, Y=-423.313, Z=-103.291, A=0.000, B=0.000, C=-3.073, POSE=1} -- 抓取点上方

--第二个目标点
P[16] =  {X=92.595, Y=-287.772, Z=-153.012, A=0.000, B=0.000, C=-3.073, POSE=1}-- 放置点
P[17] =  {X=92.595, Y=-287.772, Z=-103.012, A=0.000, B=0.000, C=-3.073, POSE=1}--放置点上方


--第三个抓取点
P[18] = {X=136.875, Y=-423.313, Z=-151.671, A=0.000, B=0.000, C=-3.073, POSE=1} -- 抓取点
P[19] = {X=136.875, Y=-423.313, Z=-101.671, A=0.000, B=0.000, C=-3.073, POSE=1} --抓取点上方

--第三个目标点
P[20] = {X=137.685, Y=-287.773, Z=-152.364, A=0.000, B=0.000, C=-3.073, POSE=1} --放置点
P[21] = {X=137.685, Y=-287.773, Z=-102.364, A=0.000, B=0.000, C=-3.073, POSE=1} --放置点上方

-- 第四个抓取点
P[22] =  {X=181.695, Y=-424.932, Z=-152.346, A=0.000, B=0.000, C=-3.073, POSE=1}--抓取点
P[23] =  {X=181.695, Y=-424.932, Z=-102.346, A=0.000, B=0.000, C=-3.073, POSE=1}--抓取点上方

-- 第四个目标点
P[24] = {X=183.449, Y=-287.772, Z=-153.201, A=0.000, B=0.000, C=-3.073, POSE=1} --放置点
P[25] = {X=183.449, Y=-287.772, Z=-103.201, A=0.000, B=0.000, C=-3.073, POSE=1} -- 放置点上方




--插件位置移动P[51]-P[100]

--第一个插件抓取点
P[51]={X=349.282, Y=-424.718, Z=-140.424, A=0.000, B=0.000, C=0.105, POSE=0} --抓取点
P[52] ={X=349.282, Y=-424.718, Z=-90.424, A=0.000, B=0.000, C=0.105, POSE=0} --抓取点上方

-- 第一个插件点
P[53] = {X=365.639, Y=-182.071, Z=-141.396, A=0.000, B=0.000, C=-1.457, POSE=0} --插件点
P[54] = {X=365.639, Y=-182.071, Z=-91.396, A=0.000, B=0.000, C=-1.457, POSE=0}--插件点上方


-- 第二个插件抓取点
P[55] = {X=282.654, Y=-423.956, Z=-139.956, A=0.000, B=0.000, C=0.108, POSE=0} --抓取点
P[56] = {X=282.654, Y=-423.956, Z=-89.956, A=0.000, B=0.000, C=0.108, POSE=0} --抓取点上方

-- 第二个插件点
P[57] ={X=267.399, Y=-177.581, Z=-141.828, A=0.000, B=0.000, C=-1.481, POSE=0} -- 插件点
P[58] ={X=267.399, Y=-177.581, Z=-91.828, A=0.000, B=0.000, C=-1.481, POSE=0} --插件点上方


--涂胶位置P[101]-P[150]
P[130]=  {X=379.165, Y=-155.791, Z=-67.191, A=0.000, B=0.000, C=2.574, POSE=0}


P[101]= {X=379.165, Y=-155.791, Z=-117.191, A=0.000, B=0.000, C=2.574, POSE=0}
P[102]= {X=365.460, Y=-173.798, Z=-117.191, A=0.000, B=0.000, C=2.534, POSE=0}
P[103]= {X=364.573, Y=-197.687, Z=-117.191, A=0.000, B=0.000, C=2.454, POSE=0}
P[104]= {X=381.307, Y=-207.575, Z=-117.191, A=0.000, B=0.000, C=2.398, POSE=0}
P[105]= {X=402.768, Y=-202.102, Z=-117.191, A=0.000, B=0.000, C=2.385, POSE=0}
P[106]= {X=436.578, Y=-179.447, Z=-121.732, A=0.000, B=0.000, C=2.396, POSE=0}
P[107]= {X=458.712, Y=-161.703, Z=-124.935, A=0.000, B=0.000, C=2.402, POSE=0}
P[108]= {X=481.524, Y=-143.289, Z=-128.444, A=0.000, B=0.000, C=2.353, POSE=0}
P[109]= {X=481.146, Y=-140.390, Z=-126.819, A=0.000, B=0.000, C=2.311, POSE=0}
P[110]= {X=484.634, Y=-127.860, Z=-127.125, A=0.000, B=0.000, C=2.216, POSE=0}
P[111]= {X=498.733, Y=-116.311, Z=-128.930, A=0.000, B=0.000, C=2.207, POSE=0}
P[112]= {X=500.455, Y=-108.696, Z=-129.146, A=0.000, B=0.000, C=2.158, POSE=0}
P[113]= {X=513.717, Y=-84.156, Z=-129.245, A=0.000, B=0.000, C=2.140, POSE=0}
P[114]= {X=523.369, Y=-44.651, Z=-122.337, A=0.000, B=0.000, C=2.231, POSE=0}
P[115]= {X=513.073, Y=-26.376, Z=-122.337, A=0.000, B=0.000, C=2.308, POSE=0}
P[116]= {X=486.016, Y=-34.385, Z=-128.462, A=0.000, B=0.000, C=2.401, POSE=0}
P[117]= {X=463.564, Y=-53.153, Z=-128.463, A=0.000, B=0.000, C=2.421, POSE=0}
P[118]= {X=439.400, Y=-82.536, Z=-126.293, A=0.000, B=0.000, C=2.407, POSE=0}
P[119]= {X=420.945, Y=-104.088, Z=-126.293, A=0.000, B=0.000, C=2.389, POSE=0}
P[120]= {X=407.839, Y=-116.664, Z=-123.734, A=0.000, B=0.000, C=2.380, POSE=0}
P[121]={X=390.893, Y=-129.775, Z=-120.274, A=0.000, B=0.000, C=2.372, POSE=0}


--手机盒位置P[151]-P[200]
--1号物体外壳
P[151]=  {X=383.796, Y=103.090, Z=-126.566, A=0.000, B=0.000, C=1.713, POSE=0} --抓取点
P[152]= {X=383.796, Y=103.090, Z=-66.566, A=0.000, B=0.000, C=1.713, POSE=0}  -- 抓取点上方

P[153]= {X=378.900, Y=396.858, Z=-127.433, A=0.000, B=0.000, C=1.713, POSE=0} --目标点
P[154]= {X=378.900, Y=396.858, Z=-77.433, A=0.000, B=0.000, C=1.713, POSE=0} --目标点上方

--2号物体说明书
P[155]= {X=377.916, Y=106.127, Z=-132.726, A=0.000, B=0.000, C=1.669, POSE=0} --抓取点
P[156]= {X=377.916, Y=106.127, Z=-72.726, A=0.000, B=0.000, C=1.669, POSE=0} -- 抓取点上方

P[157]= {X=381.296, Y=298.230, Z=-159.592, A=0.000, B=0.000, C=1.691, POSE=0}   --目标点
P[158]= {X=381.296, Y=298.230, Z=-79.592, A=0.000, B=0.000, C=1.691, POSE=0}   --目标点上方

--3号物体格挡
P[159]= {X=377.917, Y=106.126, Z=-136.591, A=0.000, B=0.000, C=1.669, POSE=0}  --抓取点
P[160]= {X=377.917, Y=106.126, Z=-76.591, A=0.000, B=0.000, C=1.669, POSE=0}  -- 抓取点上方

P[161]= {X=382.637, Y=214.119, Z=-156.655, A=0.000, B=0.000, C=1.675, POSE=0}  --目标点
P[162]= {X=382.637, Y=214.119, Z=-76.655, A=0.000, B=0.000, C=1.675, POSE=0}  --目标点上方

--4号物体插头
P[163]= {X=423.261, Y=102.395, Z=-137.727, A=0.000, B=0.000, C=1.725, POSE=0}   --抓取点
P[164]= {X=423.261, Y=102.395, Z=-77.727, A=0.000, B=0.000, C=1.725, POSE=0}   -- 抓取点上方

P[165]= {X=528.148, Y=257.439, Z=-140.775, A=0.000, B=0.000, C=1.686, POSE=0}  --目标点
P[166]= {X=528.148, Y=257.439, Z=-80.775, A=0.000, B=0.000, C=1.686, POSE=0}  --目标点上方

--5号物体线
P[167]= {X=353.073, Y=102.633, Z=-137.313, A=0.000, B=0.000, C=1.695, POSE=0}    --抓取点
P[168]= {X=353.073, Y=102.633, Z=-77.313, A=0.000, B=0.000, C=1.695, POSE=0}    -- 抓取点上方

P[169]= {X=531.463, Y=182.368, Z=-141.007, A=0.000, B=0.000, C=1.723, POSE=0}   --目标点
P[170]= {X=531.463, Y=182.368, Z=-71.007, A=0.000, B=0.000, C=1.723, POSE=0}   --目标点上方


--激光走点位置P[201]-P[250]

P[201]= {X=157.801, Y=346.270, Z=-78.016, A=0.000, B=0.000, C=1.755, POSE=0}
P[202]= {X=212.392, Y=400.633, Z=-77.347, A=0.000, B=0.000, C=1.757, POSE=0}
P[203]= {X=214.596, Y=470.068, Z=-77.346, A=0.000, B=0.000, C=1.612, POSE=0}
P[204]= {X=207.402, Y=487.412, Z=-77.346, A=0.000, B=0.000, C=1.588, POSE=0}
P[205]= {X=192.676, Y=496.946, Z=-77.346, A=0.000, B=0.000, C=1.608, POSE=0}
P[206]= {X=111.924, Y=510.271, Z=-77.346, A=0.000, B=0.000, C=1.803, POSE=0}
P[207]= {X=50.155, Y=469.749, Z=-77.363, A=0.000, B=0.000, C=2.075, POSE=0}
P[208]= {X=44.026, Y=402.215, Z=-77.363, A=0.000, B=0.000, C=2.266, POSE=0}
P[209]= {X=50.959, Y=384.346, Z=-77.363, A=0.000, B=0.000, C=2.288, POSE=0}
P[210]= {X=72.168, Y=373.076, Z=-77.363, A=0.000, B=0.000, C=2.249, POSE=0}
P[211]= {X=177.795, Y=431.329, Z=-77.363, A=0.000, B=0.000, C=1.808, POSE=0}
P[212]= {X=194.153, Y=442.799, Z=-77.363, A=0.000, B=0.000, C=1.733, POSE=0}
P[213]= {X=148.789, Y=490.182, Z=-77.363, A=0.000, B=0.000, C=1.755, POSE=0}
P[214]= {X=137.272, Y=497.309, Z=-77.363, A=0.000, B=0.000, C=1.767, POSE=0}
P[215]= {X=123.631, Y=495.805, Z=-77.363, A=0.000, B=0.000, C=1.810, POSE=0}
P[216]= {X=71.685, Y=461.154, Z=-77.363, A=0.000, B=0.000, C=2.045, POSE=0}
P[217]= {X=84.355, Y=445.860, Z=-77.363, A=0.000, B=0.000, C=2.050, POSE=0}
P[218]= {X=68.474, Y=434.091, Z=-77.363, A=0.000, B=0.000, C=2.122, POSE=0}
P[219]= {X=116.245, Y=383.730, Z=-77.363, A=0.000, B=0.000, C=2.091, POSE=0}
P[220]= {X=130.286, Y=376.769, Z=-77.363, A=0.000, B=0.000, C=2.058, POSE=0}
P[221]= {X=139.332, Y=378.857, Z=-77.363, A=0.000, B=0.000, C=2.025, POSE=0}
P[222]= {X=143.517, Y=437.751, Z=-77.363, A=0.000, B=0.000, C=1.900, POSE=0}
P[223]= {X=164.853, Y=403.306, Z=-77.363, A=0.000, B=0.000, C=1.901, POSE=0}
P[224]= {X=132.031, Y=429.356, Z=-77.363, A=0.000, B=0.000, C=1.952, POSE=0}
P[225]= {X=96.570, Y=414.664, Z=-77.363, A=0.000, B=0.000, C=2.088, POSE=0}
P[226]= {X=121.214, Y=439.751, Z=-77.363, A=0.000, B=0.000, C=1.961, POSE=0}
P[227]= {X=101.364, Y=470.884, Z=-77.363, A=0.000, B=0.000, C=1.940, POSE=0}
P[228]= {X=133.670, Y=447.993, Z=-77.363, A=0.000, B=0.000, C=1.906, POSE=0}
P[229]= {X=167.280, Y=462.096, Z=-77.363, A=0.000, B=0.000, C=1.774, POSE=0}
P[230]= {X=194.088, Y=414.716, Z=-77.363, A=0.000, B=0.000, C=1.787, POSE=0}





--通用运行速度
vel=100
blend=0

--过渡点运行速度
v_slow=1

--直线运动参数
vel_L=10
blend_L=100
--程序之间间隔(s)
t1=1

--IO间隔时间(ms)
t2=100


while (true) do


R.MP(P[0],vel,blend)
R.DELAY(1)


R.MP(P[11],vel,blend)  --移动到抓取位置上方
R.WAIT()   --等待运动结束
EY12=1  --吸盘工具下探
R.DELAY_MS(100)

move(P[10],P[11],P[12],P[13])
move(P[14],P[15],P[16],P[17])
move(P[18],P[19],P[20],P[21])
move(P[22],P[23],P[24],P[25])
R.DELAY_MS(500)
move(P[24],P[25],P[22],P[23])
move(P[20],P[21],P[18],P[19])
move(P[16],P[17],P[14],P[15])
move(P[12],P[13],P[10],P[11])

R.WAIT()   --等待运动结束
EY12=0  --吸盘工具收回
R.DELAY_MS(500)



R.MP(P[52],vel,blend)  --移动到抓取位置上方
R.WAIT()   --等待运动结束
EY11=1  --夹爪工具下探
R.DELAY_MS(100)

plug(P[51],P[52],P[53],P[54])
plug(P[55],P[56],P[57],P[58])
R.DELAY_MS(500)
plug(P[53],P[54],P[51],P[52])
plug(P[57],P[58],P[55],P[56])

R.WAIT()   --等待运动结束
EY11=0  --夹爪工具收回
R.DELAY_MS(500)




R.MP(P[130],vel,blend)
R.WAIT()
EY13=1
R.DELAY_MS(t2)
R.MP(P[101],vel,blend)
R.MC(P[102],P[103],vel_L,blend_L)
R.MC(P[104],P[105],vel_L,blend_L)
R.ML(P[106],vel_L,blend_L)
R.ML(P[107],vel_L,blend_L)
R.ML(P[108],vel_L,blend_L)
R.ML(P[109],vel_L,blend_L)
R.ML(P[110],vel_L,blend_L)
R.ML(P[111],vel_L,blend_L)
R.ML(P[112],vel_L,blend_L)
R.MC(P[113],P[114],vel_L,blend_L)
R.ML(P[115],vel_L,blend_L)
R.MC(P[116],P[117],vel_L,blend_L)
R.ML(P[118],vel_L,blend_L)
R.MC(P[119],P[120],vel_L,blend_L)
R.ML(P[121],vel_L,blend_L)
R.ML(P[101],vel_L,blend_L)
R.WAIT()
R.MP(P[130],vel,blend)
R.WAIT()
EY13=0
R.DELAY_MS(t2)



R.MP(P[152],vel,blend)  --移动到抓取位置上方
R.WAIT()   --等待运动结束
EY12=1  --吸盘工具下探
R.DELAY_MS(100)

move(P[151],P[152],P[153],P[154])
move(P[155],P[156],P[157],P[158])
move(P[159],P[160],P[161],P[162])
move(P[163],P[164],P[165],P[166])
move(P[167],P[168],P[169],P[170])
R.DELAY(2)
move(P[169],P[170],P[167],P[168])
move(P[165],P[166],P[163],P[164])
move(P[161],P[162],P[159],P[160])
move(P[157],P[158],P[155],P[156])
move(P[153],P[154],P[151],P[152])

R.WAIT()   --等待运动结束
EY12=0  --吸盘工具收回
R.DELAY(3)



R.MP(P[201],vel,blend)
R.WAIT()
EY8=1
R.DELAY_MS(t2)
R.ML(P[202],vel_L,blend_L)
R.ML(P[203],vel_L,blend_L)
R.MC(P[204],P[205],vel_L,blend_L)
R.ML(P[206],vel_L,blend_L)
R.ML(P[207],vel_L,blend_L)
R.ML(P[208],vel_L,blend_L)
R.MC(P[209],P[210],vel_L,blend_L)
R.ML(P[201],vel_L,blend_L)

R.WAIT()
R.MP(P[221],vel,blend)
R.ML(P[230],vel_L,blend_L)
R.ML(P[211],vel_L,blend_L)
R.ML(P[212],vel_L,blend_L)
R.ML(P[213],vel_L,blend_L)
R.MC(P[214],P[215],vel_L,blend_L)
R.ML(P[216],vel_L,blend_L)
R.ML(P[217],vel_L,blend_L)
R.ML(P[218],vel_L,blend_L)
R.ML(P[219],vel_L,blend_L)
R.MC(P[220],P[221],vel_L,blend_L)
R.WAIT()
R.MP(P[222],vel,blend)
R.ML(P[223],vel_L,blend_L)
R.ML(P[224],vel_L,blend_L)
R.ML(P[225],vel_L,blend_L)
R.ML(P[226],vel_L,blend_L)
R.ML(P[227],vel_L,blend_L)
R.ML(P[228],vel_L,blend_L)
R.ML(P[229],vel_L,blend_L)

R.WAIT()
EY8=0
R.DELAY_MS(t2)


end
